'use strict'

// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.
// const arr = ['a', 'b', 'c'];
// const newArr = arr.concat([1, 2, 3]);
// console.log(newArr)

// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.
// const arr = ['a', 'b', 'c'];
// arr.push('1','2','3')
// console.log(arr)


// 3) Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
// const arr = [1, 2, 3];
// const newArr = arr.concat([4, 5, 6]);
// console.log(newArr)

// 4) Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
// const arr = [1, 2, 3];
// const newArr = arr.reverse();
// console.log(newArr)


// 5) Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// const arr = [1, 2, 3];
// arr.push(4, 5,6)
// console.log(arr)

// 6) Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
// const arr = [1, 2, 3];
// arr.unshift(4, 5,6)
// console.log(arr)

// 7)  Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
//   const arr = ['js', 'css', 'jq'];
//   console.log(arr[0]);


// 8) Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
// const arr = ['js', 'css', 'jq'];
//   console.log(arr[2]);

// 9) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
// const arr = [1, 2, 3, 4, 5];
// const newArr = arr.slice(0,3);
// console.log(newArr);
// 10) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5]. Скрыть решение.
// const arr = [1, 2, 3, 4, 5];
// const newArr = arr.slice(3,5);
// console.log(newArr);
// 11) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
// const arr = [1, 2, 3, 4, 5];
// const newArr = arr.splice(1,2);
// console.log(arr);


// 12)  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4]. Показать решение.
// const arr = [1, 2, 3, 4, 5];
// const newArr = arr.splice(1,3);
// console.log(newArr);
// 13) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5]. Показать решение.
// const arr = [1, 2, 3, 4, 5];
// arr.splice(3,0, 'a', 'b', 'c');
// console.log(arr);
// 14) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']. Показать решение. (edited)
// const arr = [1, 2, 3, 4, 5];
// arr.splice(1, 0,'a', 'b');
// arr.splice(6, 0, 'c');
// arr.splice(8, 0, 'e');
// console.log(arr);

// // 1) Вибираємо випадкове число (від 0 до довжини масива);
// // 2) Записати в змінну звернення типу масив[індекс];
// // 3) Вивести змінну з пунтку 2 в алерт;

// const arr = [1, 2, 3, 4, 5];

// let index = Math.floor(Math.random()*arr.length);
// alert(arr[index]);

// 1) Через prompt вводимо свій варіант тваринки
// 2) Варіант компютера записати в змінну
// 3) Порівнюємо наш варіант з копютерним
// 3,1) Якщо варіанти співпали тоді виводимо алертом що юзер виграва.
// 3,2) Якщо варіанти не співпали кажемо що користувач програв і виводимо варіант компютера.

// const animal = prompt('animal')
// const animalComp = ["duck", 'pig'];
// let index = Math.floor(Math.random()*animalComp.length);

// if (animalComp[index].includes(animal)){
//     alert('good')
// } else if (index !== animalComp[index]) {
//     alert('no good')
// };


// Написати гру Камінь Ножиці Папір.
// Варіанти вибору потрібно зберігати в масиві
// Користувач вводить свій варіант
// Компютер вибирає свій рандомний варівант з масиву
// Первіряємо вибір користувача і вибір компютера. 
// Опрацювати всі варіанти:
// 1) Варіанти де виграє користувач
// 2) Варіанти де виграє компютер
// 3) Варіанти де виходить нічия.

// const logout = prompt('lets go ...')
// const game = ["камень", 'ножницы', "бумага"];
// let index = Math.floor(Math.random()*game.length);
//    
// console.log(random);
// if(logout === "камень" && random === "камень"){alert('ничья')
// }else if (logout === "камень" && random === "бумага")
// {alert('компуктер вийграв!!!')
// }else if (logout === "камень" && random === "ножницы")
// {alert('Ты красавчик!!!!')
// }else if(logout === "ножницы" && random === "ножницы"){alert('ничья')
// }else if (logout === "ножницы" && random === "бумага")
// {alert('Ты красавчик!!!!')
// }else if (logout === "ножницы" && random === "камень")
// {alert('компуктер вийграв!!!')
// }
// else if(logout === "бумага" && random === "бумага"){alert('ничья')
// }else if (logout === "бумага" && random === "ножницы")
// {alert('компуктер вийграв!!!')
// }else if (logout === "бумага" && random === "камень")
// {alert('Ты красавчик!!!!')
// }else{alert('Вася, ти не прав!')}

// 1) Записуємо в змінну строку з промта
// 2) Зробити строку масивом
// 3) Скопіювати масив
// 4) Реверсимо масив
// 5) З масивів робимо строки
// 6) Порівнюємо дві строки і виводимо результат в консоль; 

// let a = prompt('lets go ...')
// let b = a.split(' ');
// let c = b.slice();
// const d = c.reverse();
// let u = d.join(' ')

// console.log(u)





// 1) Запитати логін
// 2) Перевірити чи існує логін в базі
// 3) Якщо логін існує вивести алерт ("Такий логін вже існує")
// 4) Якщо логін не існує вивести алерт ("Вітаємо")

// let logins = ['rew', 'qwewwe', 'apple', 'js', 'row', 'col']
// let a;

// a = prompt('password please')
// if(logins.includes(a)){alert('Такий логін вже існує')}else{alert('Вітаємо')}