// 1. Зайдите в консоль своего браузера. При помощи оператора определения типа уточните тип следующих величин: «Привет», 123, true, «true».
//   let a = "Привет";
//   let b = 123;
//   let c = true;
//   let d = "true";
//   console.log(typeof a);
//   console.log(typeof b);
//   console.log(typeof c);
//   console.log(typeof d);
// 2. Зайдите в консоль своего браузера. При помощи математических операторов (сложение, вычитание и т.д.) найдите значения выражений: 5 + 3, 5 — 3, 5 * 3, 5 / 3.
    //  let a = 5;
    //  let b= 3;
    //  let result;
    //  console.log(a+b);
    //  result=a+b;
    //  console.log(result);
    //  console.log(a-b);
    //  console.log(a*b);
    //  console.log(a/b);
     


// 3. Зайдите в консоль своего браузера. При помощи оператора нахождения остатка от деления %, найдите значения выражений: 5 % 3, 3 % 5.
//  let a = 5%3;
//  console.log(a);
//  let b = 3%5;
//  console.log(b);



// 4. Зайдите в консоль своего браузера. При помощи оператора + (сложение, склеивание) найдите значения выражений: 5 + ‘3’ , ‘5’ — 3, 75 + ‘кг’.
// let a = 5 +'3';
// let b = '5' - 3;
// let c = 75 + 'кг';
// console.log(a);
// console.log(b);
// console.log(c);



// 5. Создайте переменные строкового, числового и булева типов. Выведите их содержимое.
// let a = "5";
// let b = 5;
// let c = true;
// console.log(typeof a);
// console.log(typeof b);
// console.log(typeof c);




// 6. Напишите скрипт, который находит площадь прямоугольника длиной 23см., шириной 10см.
// let a = 23;
//  let b = 10;
//  console.log(a*b);
// 7. (*) Найди двенадцатый элемент последовательности Леонардо Пизанского (нужно использовать функцию Math.pow(число, степень))


// 8. (*) Даны размер ипотечного кредита, процентная ставка, кол-во лет. Найти переплату по кредиту.

// _________________________________
// 9) Створіть змінну num і надайте їй значення 3. Виведіть значення цієї змінної на екран за допомогою методу alert
//  const num =3;
//  alert(num);

// 10) Створіть змінні a = 10 і b = 2. Виведіть на екран їх суму, різницю, добуток і частку (результат ділення)
// let a = 10;
// let b = 2;
// console.log(a+b);
// console.log(a*b);
// console.log(a-b);
// console.log(a/b);

// 11) Створіть змінні c = 15 і d = 2. Підсумуйте їх, а результат надайте змінної result. Виведіть на екран значення змінної result
// let c = 10;
// let d = 2;
// result=c+d;
// console.log(result);

// 12) Створіть змінні a = 10, b = 2 і c = 5. Виведіть на екран їх суму.
// let a = 10;
// let b = 2;
// let c = 5;
// console.log(a+b+c);

// 13) Створіть змінні a = 17 і b = 10. Відніміть від a змінну b і результат надайте зміннії c. Потім створіть змінну d, надайте їй значення 7. Складіть змінні c і d, а результат запишіть в змінну result. Виведіть на екран значення змінної result.
// let a = 17;
// let b = 10;
// let c = a+b;
// let d = 7;
// let result= c+d;
// console.log(result);
// 14) Запитайте ім'я користувача за допомогою методи prompt. Виведіть за допомогою alert повідомлення 'Ваше ім'я
// %значення що отримали з prompt%'

// const name = prompt("your name");
// alert (name);


// 15) Створіть три змінні - година, хвилина, секунда. З їх допомогою виведіть поточний час в форматі 'година: хвилина: секунда'.
// let a = '16: ';
// let b = '14: ';
// let c = '40';
// let time = a + b + c;
// console.log(time);

// 16) Створіть змінну, надайте їй число. Зведіть це число в квадрат. Виведіть його на екран
// let a = 5;
// let b = Math.pow(a,2);
// alert(b);

// 17) Переробіть цей код так, щоб в ньому використовувалися операції + =, - =, * =, / =. Кількість рядків коду при цьому не повинно змінитися.

//    var num = 47;
//    num += 7;
//    num -= 18;
//    num *= 10;
//    num /= 15;
//    alert (num);


// 18) Створіть змінну str і надайте їй значення 'Hello World'. Виведіть значення цієї змінної на екран
// let str = 'Hello World';
// alert(str);

// 19) Створіть змінні str1 = 'Hello,' і str2 = 'World!'. За допомогою цих змінних і операції додавання рядків виведіть на екран фразу 'Hello World'.
// let str1 = 'Hello ';
// let str2 = 'World'
// alert(str1+str2);
// 20) Створіть змінну name і надайте їй ваше ім'я. Створіть змінну age і надайте їй ваш вік. Виведіть на екран 'Привіт, я  % Ім'я%!'Мені% Вік% років!'.
// let name = "dmitry";
// let age = '30';
// alert(`Hello, I ${name} my age "${age}" `);
// 21) Створіть змінну str і надайте їй значення 'abcde'. Звертаючись до окремих символів цього рядка виведіть на екран символ 'a', символ 'c', символ 'e'
    //   let str ="abcde";
    //   console.log(str.split(''));
    //   console.log(str[0]);
    //   console.log(str[2]);
    //   console.log(str[4]);
// 22) Створіть змінну num і надайте їй значення '12345'. Знайдіть суму, різницю, добуток, частку цифр цього числа
// і виведіть ці значення в консоль
// let num = '12345';
// let num1 = +num[0] + +num[1] + +num[2] + +num[3] + +num[4];
// alert(num1);

// 23) Дана рядок 'js'. Зробіть з неї рядок 'JS'.
    // let a = "JS";
    // console.log(a.toUpperCase());

// 24) Дана рядок 'JS'. Зробіть з неї рядок 'js'
    // let a = "JS";
    // console.log(a.toLowerCase());

// 25) Дана рядок 'я вчу javascript!'. Знайдіть кількість символів в цьому рядку.
//    let a = 'я вчу javascript!';
//    console.log(a.length);

// 26) Даны переменные a = 10 и b = 3. Найдите остаток от деления a на b.
//  let a = 10,
//     b=3;
// console.log(a%b);


// 27) Возведите 2 в 10 степень. Результат запишите в переменную st.
    //   let a = Math.pow(2,10);
    //   let st =a;
    //   console.log(st);

// 28) Найдите квадратный корень из 245.
//    let a = Math.sqrt(245);
//    alert(a);

// 29) Найдите квадратный корень из 379. Результат округлите до целых, до десятых, до сотых. (toFixed(0))
//  let a = Math.sqrt(379);
//  alert(a.toFixed(0));

// 30) Найдите квадратный корень из 587. Округлите результат в большую и меньшую стороны (edited) 
// Перечень методов для работы со строками
// let a = Math.sqrt(587);
// console.log(Math.ceil(a));
// console.log(Math.floor(a));
